#include <stdio.h>
#include <stdlib.h>

int main() {
    int n;
    printf("Введіть розмір масиву: ");
    scanf("%d", &n);

    int *a = (int*)malloc(n * sizeof(int));//виділяється пам'ять для масиву.n * sizeof(int) обчислює загальний розмір пам'яті, який потрібно виділити для масиву a
    printf("Введіть елементи масиву:\n");
    for (int i = 0; i < n; i++) {
        scanf("%d", &a[i]);
    }
//обчислення максимального за модулем числа
    int abs_max = 0;//змінна для збер. поточного макс. числа
    for (int i = 0; i < n; i++) {
        if (abs(a[i]) > abs_max) {
            abs_max = abs(a[i]);//перевіряється чи значення поточного елемента більше за макс. значення
        }
    }

    printf("Максимальний за модулем елемент масиву: %d\n", abs_max);

    free(a);//звільнює пам'ять для виділеного масиву 
    return 0;
}